---
kind: type
id: T:Autodesk.Revit.DB.ConnectionValidationWarning
source: html/610c2f13-1d95-3a43-b845-b39ab3f02d46.htm
---
# Autodesk.Revit.DB.ConnectionValidationWarning

Contains information about a specific connection validation problem.

## Syntax (C#)
```csharp
public class ConnectionValidationWarning : IDisposable
```